Revit 2024 API
ParameterTypeId.StairsRunHeight Property
 "Run Height": Run Height
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StairsRunHeight { get; }
Visual Basic
Public Shared ReadOnly Property StairsRunHeight As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StairsRunHeight {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace